per1234/InoPlatformPropertiesTest/dummy_architecture/boards.txt
menu.dummy_preferences_property=Dummy Menu

dummy_board.name=InoPlatformPropertiesTest

dummy_board.upload.tool=dummy_tool
dummy_board.upload.protocol=dummy_protocol

dummy_board.bootloader.tool=dummy_tool

dummy_board.build.core=dummy_core
dummy_board.build.board=DUMMY_ARCHITECTURE_DUMMY_BOARD
dummy_board.build.mcu=atmega328p

dummy_board.dummy_boards_property=dummy_boards_property_value
dummy_board.dummy_override_property=dummy_override_property_value_boards

# this creates a preferences.txt property with a meaningful name
dummy_board.menu.dummy_preferences_property.dummy_preferences_property_value=Dummy Menu Item
